app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    # If put artist id in params
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      # If artist not found
      if @artist.nil?
        redirect_to artists_path, alert :"Artist not found"
      else
      # Put artist's songs only
        @songs = @artist.songs
      end
    # If only songs in params
    else
      @songs = Song.all